import 'dart:math';

import 'package:flutter/material.dart';

class names{

  static List<String> temp = [];
  static List color = [
    Colors.deepPurple,
    Colors.purpleAccent,
    Colors.teal,
    Colors.redAccent,
    Colors.greenAccent,
    Colors.green,
    Colors.amber,
    Colors.lightGreenAccent,
    Colors.cyan,
    Colors.deepOrange,
  ];
  static Random r = Random();

  static List rang=[
    [
      Color(0xff4158D0),
      Color(0xffC850C0),
      Color(0xffFFCC70),
    ],
    [
      Color(0xff0093E9),
      Color(0xff80D0C7),
    ],
    [
      Color(0xff8EC5FC),
      Color(0xffE0C3FC),
    ],
    [
      Color(0xffFFFFFF),
      Color(0xff6284FF),
      Color(0xffFF0000),
    ],
    [
      Color(0xff00DBDE),
      Color(0xffFC00FF),
    ],
    [
      Color(0xff5282FF),
      Color(0xffFFE32C),
    ],
    [
      Color(0xffFFE53B),
      Color(0xffFF2525),
    ],
    [
      Color(0xff21D4FD),
      Color(0xffB721FF),
    ],
    [
      Color(0xffF4D03F),
      Color(0xff16A085),
      Color(0xffDD41C9),
    ],
    [
      Color(0xffDD41C9),
      Color(0xff21D4FD),
      Color(0xff5282FF),
    ],
  ];

  static List<String> myemoji = [
    "😀 😃 😄 😁 😆 😅",
    "😺 😸 😹 😻 😼 😽",
    "❤ 🧡 💛 💚 💙 💜",
    "💀 ☠👽 👾 🤖 🎃",
    "🤩😍🥰🥰😍🤩",
    "😖🙁😓😖😔",
    "🎆🎇✨🎉🎊🎆",
    "🍟🍔🍕🌭🧂🍿",
    "🌺🌻🌼🌷🥀☘",
    "🍑🍒🍐🍓🍅🍆",
    "🛺🚕🚓🚗🚑🚒",
  ];

  static List<String> fontlist = [
    "family1",
    "family2",
    "family3",
    "family4",
    "family5",
    "family6",
    "family7"
  ];

  List<String> name=[
      "Love Shayari",
      "Sad Shayari",
      "Sorry Shayari",
      "Hurt Shayari",
      "Nafrat Shayari",
      "Funny Shayari",
      "Good Night Shayari",
      "Yaad Shayari",
      "Birthday Shayari",
      "Two Line Shayari"
  ];

  List<String> love=[
    """ मेरी जिंदगी में सारी खुशियाँ तेरे बहाने से है,
आधी तुझे सताने से है,
आधी तुझे मनाने से है।""",
    """ इश्क की उम्र नहीं होती,
ना ही दौर होता है,
इश्क तो इश्क है,
जब होता है बेहिसाब होता है।""",
    """ तरसती नज़रो ने हर पल आपको ऐसे मांगा
जैसे हर अमावस में चांद मांगा
रूठ गया वो खुदा भी हमसे
जब हमने अपनी हर दुआ में आपको मांगा ।""",
    """ तेरा वजूद मेरी दुआओं में हो
मेरी हाथों की लकीरों में तू ऐसे समाये 
मैं दुआ में अमीन कहूं
और तू मेरी हो जाये""",
    """ ज़िन्दगी में नहीं है डर
तेरा साथ है अगर
तू जब आये सामने
तो हो जाता है मेरा Background Blurr 😉""",
  ];

  List<String> sad=[
    """💦 Sad Love Shayari 💦
दिन हुआ है, तो रात भी होगी,
मत हो उदास, उससे कभी बात भी होगी।
वो प्यार है ही इतना प्यारा,
ज़िंदगी रही तो मुलाकात भी होगी।""",
   """ जिंदगी तो कट ही जाती है,
बस यही एक जिंदगी भर
गम रहेगा की हम उसे ना पा सके।""",
   """ पूछा था हाल उन्होंने मेरा
बड़ी मुद्दतों के बाद,
कुछ गिर गया है आँख में,
कह कर हम रो पड़े।""",
    """ अब शिकवा करें भी तो करें किससे,
क्योंकि ये दर्द भी मेरा,
और दर्द देने वाला भी मेरा।""",
    """ हम तेरा हाल पूंछते भी कैसे सुना है,
मोहब्बत करने वाले बोलते कम रोतें ज्यादा हैं.""",
  ];

  List<String> sorry=[
   """ सॉरी अगर दिल दुखाया हो 
तुम्हारा साथ पाकर दिल जताया हो 
तुम्हारे दिल में बस्ते हैं हम 
जो अनजाने में खुद को चोट पहुँचाया हो""",
    """ मोहब्बत हो तो तो तरफ़ा हो 
हर बार गलती मैं ही क्यों मानूं 
तेरा हक़ भी है मुझे पे तो जलता
सिर्फ मैं की कौन माफ़ी मांग के बात आगे बढ़ाऊं""",
    """ तुम्हारा ख्याल की उदासी है 
हो अनजाने में भूल तो माफ़ी है 
मोहब्बत ज़रूरत नहीं है 
मोहब्बत में एक तरफ़ा प्यार ही काफी है""",
    """ छोटी छोटी बातों पर नजर मत हुआ करो,
अगर गलती हो जाए तो माफ़ कर दिया करो।
I am Sorry""",
    """ माफ कर दो मैं जब तक जिंदा रहूंगा,
उन बातों के लिए , मैं शर्मिंदा रहूंगा।
Sorry""",
  ];

  List<String> hurt=[
    """ चेहरे तुमको मिल जायेंगे,
हमसे कहीं ज्यादा खूबसूरत,
पर जब बात दिल की आएगी,
तोह हार जाओगे🤦🏻‍♂️""",
    """ उसके हिज़्र के दिन मेरा साया
मुझसे ही दूर हो गया,
जो चाहे करना इश्क़ फिर से हमने,
तोह उसको काबुल न हुआ😍🤭""",
    """ जब कोई आप दे कहे के इसे आप में एक खूबी नजर आती है
तो इसे गले लगा ले
क्यू के नादान लोगो को प्यार और तवाज्जा की ज़रूरत होती है""",
    """ ये कहेना बड़े कमाल की बात है
कि मुझ में कोई कमाल की बात नहीं है""",
    """ दिल खफा है मुझसे, लगता है रूठा है,
न जाने क्यों ऐसा लगा, अन्दर ही अन्दर कुछ टूटा है💔""",
  ];

  List<String> nafrat=[
    """ बैठ कर सोचते हैं अब
कि क्या खोया क्या पाया
उनकी नफरत ने तोड़े बहुत
मेरी वफ़ा के घर""",
    """ हक़ देंगे पूरा उसे निभाने का
कबूल करते हैं नफरत तेरी
खैरात में जो मिले हमें
कबूल तो उसकी मोहब्बत भी नहीं करते हम""",
    """ यही तो राज़-ए-उल्फ़त है
जो हर आंसू का रुख़ मोड़ा…
बहुत ख़ुश हैं
तेरे बारे में जबसे सोचना छोड़ा….💔""",
   """ नाही तुम कभी आ सके और
नाही हम कभी जा सके
नाही तुम कभी याद कर सके और
नाही हम तुम्हे कभी भुला सके""",
   """ जो लोग नफरत करते हैं वो लोग अच्छे लगते हैं
क्योंकि अगर सब मुहब्बत करेंगे तो
कहीं नज़र ना लग जाए मुझे""",
  ];

  List<String> funny=[
    """ अर्ज किया है वो तुम्हें  DP दिखाकर गुमराह करेगी,
मगर तुम आधार कार्ड पर अड़े रहना..!!

""",
   """ रोने से कुछ नहीं होता, 
   सिर्फ आंसू निकल जाते है। यह भी साथ नहीं देते,
    गिरते है और फिसल जाते हैं।।😉😆""",
    """3: हर किसी को सफाई 🧐मत दिजिए
आप इंसान 🌝 है डिटर्जेंट पाउडर 🤳 नहीं""",
    """ मेरा दिल कर रहा है एक दुखी पोस्ट करु 😂😂
पर तुम सब पहले से ही दुखी आत्मा हो 😂😂
मेरी पोस्ट रो रो के बहा दोगे 😂😂""",
    """ आज – कल शैंपू में इतने काजू,
बादाम, विटामिन और मिनरल्स
पाये जाते हैं की…
सोच रहा हूँ खाने के बाद एक
चम्मच लेना शुरू कर दूँ…🤣😝😂""",
  ];

  List<String> goodnight=[
   """ सपनों से प्यार करने वालों को अक्सर
    रात को नींद नहीं आती I Good Night""",
    """ आगाज़ तो कर,
     आज नहीं तो कल, 
     जीत की सुबह होगी I Good Night""",
    """ सुबह वही जगते हैं 
    जो सपने पूरा करना चाहते हैं
     I Good Night""",
    """ जो मेहनत का सूर्य अस्त नहीं होने देते 
    वही सफलता का सूर्य उदय देखते हैं। Good Night""",
    """ ख़ामोशी से भी नेक काम होते हैं 
    I मैंने देखा है पेड़ों को छाव देते हुए I Good Night""",
  ];

  List<String> yaad=[
    """ इश्क़ तो बस यादों का घेरा होता है 
    प्यार का तो पहला अक्षर ही अधूरा होता है""",
   """ आज फिर मुमकिन नही कि, 
   मैं सो जाऊँ; यादें फिर बहुत आ रही हैं,
    नींदें उड़ाने वाली""",
    """ आया ही था ख्याल के आँखें छलक पड़ी आंसू तुम्हारी याद के कितने करीब थे""",
   """ इक तिरी याद का आलम कि बदलता ही नहीं 
   वरना वक़्त आने पे हर चीज़ बदल जाती है""",
    """ अहसास मिटा,
     तलाश मिटी, 
     मिट गई उम्मीदें भी,
     सब मिट गया पर जो न मिट सका, 
     वो है यादे तेरी।""",
  ];

  List<String> birthday=[
    """“ इतनी सी मेरी दुआ क़बूल हो जाये,
“की तेरी हर दुआ क़बूल हो जाये,
“तुझे मिले जन्मदिन पर लाखों ख़ुशियाँ,
“और जो तुम चाहो रब से,
“वो पल भर में मंज़ूर हो जाये,

~•”Happy Birthday”•~""",
    """ खुद भी नाचेंगे ‍तुमको ‍भी नचायेंगे……..
बड़ी धुम धाम से तुम्हारा बर्थड़े बनायेंगे …….
गिफ्ट मे मांगो अगर जान हमारी तो आपकी ‍कसम हसँ कर कुरबाँ हो जायेगें…….
Haքքy WaLa Birthday""",
    """☵☶☆☆☴☵
“ जन्मदिन का ये लम्हा मुबारक हो आपको”
“ख़ुशियों का ये लम्हा मुबारक हो आपको”
“आने वाला कल लाये”
“आपके लिये ख़ुशियाँ हज़ार और”
“वो ख़ुशियाँ मुबारक हो आपको”
“Wish You A Very”
“Happy Birthday”
☵☶☆☆☴☵""",
    """ फूलो सा महकता रहे
हमेशा जीवन तुम्हारा
खुशिया चूमे कदम तुम्हरे
बहुत सारा प्यार और आशीर्वाद हमारा

जन्मदिन की हार्दिक शुभकामनाएं""",
    """ आपका जन्म दिन हैं “ख़ास”
❤️क्यूँकि आप होते हैं सबके
दिल के “पास”…
और आज पूरी हो आपकी
हर “आस”..
HAPPY BIRTHDAY"""
  ];

  List<String> two=[
    """ कोशिश बहुत की के राज-ए-मोहब्बत बयां न हो,
पर मुमकिन कहां है के आग लगे और धुंआ न हो..!!""",
    """ भूल जाऊं मैं तुम्हे, लोग मुझसे ये आसानी से कह देते हैं,
शायद खेल समझते हैं इश्क़ को वो, इसलिए इसे मुंह ज़ुबानी कह देते हैं।""",
    """ तुम्हे पाकर भी खुश न था, तुम्हे खोने का भी गम है
तेरे जाने के बाद भी, ‘तेरा’ होने का गम है।""",
    """ मै क्या बताऊं कैसी परेशानियों में हूं,
काग़ज़ की एक नाव हूं और पानियों में हूं.!""",
    """ सोचा नही था जिंदगी में ऐसे भी फसाने होंगे,
रोना भी जरूरी होगा और आसूं भी छुपाने होंगे।""",
  ];


}